app/Http/Controllers/Auth/LoginController.php

select * from `clubs`
select * from `countries` limit 1
select * from `roles` where `name` not in ('SuperAdmin')
select * from `organizations` where `status` = 1 limit 1
select * from `clubs` where `is_approved` = 1 and (select count(*) from `users` where `clubs`.`id` = `users`.`club_id`) > 0
---
    public function showLoginForm()
    {
        $clubs = Club::all();
        $countries = Country::first();
        $season = Season::where('status', 1)->first();
        $roles = Role::whereNotIn('name', ['SuperAdmin'])->get();
        $organizations = Organization::where('status', 1)->first();
        $general = generalSetting::first();
        $clubs = Club::where('is_approved',1)->has('users','>',0)->get();

select * from `users` where `email` = 'judge@gmail.com' limit 1
---
    public function login(Request $request)
    {

        $general = generalSetting::first();
        $validator = Validator::make(
            $request->all(),
            [
                'email'                 => 'required|email|max:255',
                'password'              => 'required',
            ],
            [
                'email.required'                 => 'Email is required',
                'password.required'              => 'password is required',
            ]

        );

        if ($validator->fails()) {
            return back()->withErrors($validator)->withInput();
        }
        $input = $request->all();
        $user = User::where('email', $request->input('email'))->first();

insert into `active_users` (`user_id`) values (5)
insert into `day_users` (`user_id`, `date`) values (1, '2022-10-25 14:26:51')
select * from `day_users` where `day_users`.`user_id` = 5 and `day_users`.`user_id` is not null limit 1
select * from `users` where `users`.`id` = 5 limit 1
update `day_users` set `date` = '2022-10-25 05:38:20' where `user_id` = 5
---
                    function ($message) use ($user_email) {
                        $message->to($user_email);

                    }
                );
                return redirect()->route('verify.index');
            }
        }
        }
    }
                }

            DB::table('active_users')->insert(['user_id' => Auth::user()->id]);
            $dayUser = User::find(Auth::user()->id)->dayUser != null ? User::find(Auth::user()->id)->dayUser : null;
            if ($dayUser == null) {
                DB::table('day_users')->insert(['user_id' => Auth::user()->id, 'date' => Carbon::now()]);
            } else {
                $lastUse = User::find(Auth::user()->id)->dayUser;
                DB::table('day_users')
                    ->where('user_id', Auth::user()->id)
                    ->update(['date' => Carbon::now()]);