app/Http/Controllers/settings/GeneralSettingsController.php

    public function create()
    {
        $general = generalSetting::first();
        $organizations = Organization::all();

        $roles = Role::all();
---
select * from `organizations`
select * from `roles`