<?php 
return [
'add_new_event'=>'புதிய நிகழ்வைச் சேர்க்கவும்',
'select_league'=>'லீக்கைத் தேர்ந்தெடுக்கவும்',
'select_event'=>'நிகழ்வைத் தேர்ந்தெடுக்கவும்',
'select_event_org'=>'நிகழ்வு அமைப்பாளரைத் தேர்ந்தெடுக்கவும்',
'date'=>'தேதி',
'select_ages'=>'வயதுக் குழுக்களைத் தேர்ந்தெடுக்கவும்',
'select_gender'=>'பாலினத்தைத் தேர்ந்தெடுக்கவும்',
'rules'=>'நிகழ்வு விதிகள்',
'all_events'=>'அனைத்து நிகழ்வுகள்',
'select_season'=>'பருவத்தைத் தேர்ந்தெடுக்கவும்',
'select_age'=>'வயதுக் குழுவைத் தேர்ந்தெடுக்கவும்',
'select_prize_status'=>'பரிசு நிலையைத் தேர்ந்தெடுக்கவும்',
'select_event_status'=>'நிகழ்வு நிலையைத் தேர்ந்தெடுக்கவும்',
'export_all'=>'அனைத்துபங்கேற்பாளர்கள் ஏற்றுமதி',
'event_org'=>'நிகழ்ச்சி அமைப்பாளர்',
'prize_given'=>'பரிசு வழங்கப்பட்டது',
'export'=>'ஏற்றுமதி பங்கேற்பாளர்கள்',
'event'=>'நிகழ்வின் பெயர்',
'status'=>'நிகழ்வு நிலை',
'starter'=>'ஸ்டார்டர்',
'judge'=>'நீதிபதி',
'time'=>'நேரம்',     

]
?>