<?php
return [
    'staffs_lists'=>'பணியாளர்கள் பட்டியல்',
    'add_new'=>'புதியனவற்றை சேர்',
    'export_id_card'=>'ஏற்றுமதி பணியாளர் அடையாள அட்டை',
    'f_name'=>'முதல் பெயர்',
    'l_name'=>'கடைசி பெயர்',
    'role'=>'ரோல்',
    'sil_mem'=>'SIL உறுப்பினர்',
    'showing'=>'காட்டும்',
    'entries'=>'உள்ளீடுகள்',
    'reg_as'=>'பதிவு ஒப்பாக',
    'mem_sangamil'=>' Sangam IL உறுப்பினரா?',
    'yes'=>'ஆம்',
    'no'=>'இல்லை',
    'register'=>'பதிவு செய்',
    'staffs'=>'பணியாளர்கள்',
    'add_new_staff'=>'புதிய பணியாளர்களை சேர்க்க',
    'back'=>'பின்னால்',
    'age'=>'வயது',
    'add_new_member'=>'புதிய உறுப்பினர் சேர்க்க',
    'male'=>'ஆண்',
    'female'=>'பெண்',
    'user_lists'=>'பயனர் பட்டியல்கள்',
      //import users
      'import_user_details'=>'பயனர் விவரங்களை இறக்குமதி செய்யவும்',
      'instructions'=>'வழிமுறைகள்',
      '1'=>'மாதிரி எக்செல் கோப்பைப் பதிவிறக்கி, அதை டேட்டாவுடன் நிரப்பவும்',
      '2'=>'தரவு எவ்வாறு நிரப்பப்பட வேண்டும் என்பதைப் புரிந்துகொள்ள, உதாரணக் கோப்பைப் பதிவிறக்கலாம்',
      '3'=>'நீங்கள் எக்செல் கோப்பை பதிவிறக்கம் செய்து நிரப்பியவுடன், கீழே உள்ள படிவத்தில் பதிவேற்றி சமர்ப்பிக்கவும்',
      '4'=>'கோப்பு வடிவம் .xlsx அல்லது .xls ஆக இருக்க வேண்டும்',
      'download'=>'மாதிரி எக்செல் கோப்பைப் பதிவிறக்கவும்',
      'more'=>'மேலும் வழிமுறைகள்',
      '5'=>'DOB வடிவம் yyyy.mm.dd ஆக இருக்க வேண்டும்',
      '6'=>'கோப்பு வடிவம் .xlsx அல்லது .xls ஆக இருக்க வேண்டும்',
      'upload_mem'=>'உறுப்பினர்களைப் பதிவேற்றவும்',
      'upload_file'=>'கோப்பை பதிவேற்றவும்',
      'upload'=>'பதிவேற்றவும்'


]
?>