<?php 
return [
    'add_new_venue'=>'புதிய இடத்தை சேர்க்க',
    'place'=>'இடப் பெயர்',
    'contact_person'=>'தொடர்பு நபர் பெயர்',
    'map'=>'கூகுள் வரைபடம்',
    'track_details'=>'தட விவரங்களைச் சேர்க்க',
    'field_details'=>'கள விவரங்களைச் சேர்க்கவும்',
    'track_name'=>'பாதையின் பெயர்',
    'max_len'=>'அதிகபட்ச பாதை நீளம்',
    'count'=>'தட எண்ணிக்கை',
    'nameT'=>'தட பெயர்',
    'nameF'=>'கள பெயர்',
    'lattitude'=>'அட்சரேகை',
    'longitude'=>'தீர்க்கரேகை',
    'track'=>'தட விவரங்கள்',
    'field'=>'கள விவரங்கள்',
    'edit_venue'=>'இடம் திருத்த'


]
?>