<?php 
return [
    'add_new_venue'=>'புதிய இடத்தை சேர்க்க',
    'place'=>'இடப் பெயர்',
    'contact_person'=>'தொடர்பு நபர் பெயர்',
    'map'=>'கூகுள் வரைபடம்',
    'track_details'=>'தட விவரங்களைச் சேர்க்க',
    'field_details'=>'கள விவரங்களைச் சேர்க்கவும்',
    'track_name'=>'பாதையின் பெயர்',
    'max_len'=>'அதிகபட்ச பாதை நீளம்',
    'count'=>'தட எண்ணிக்கை',
    'nameT'=>'தட பெயர்',
    'nameF'=>'கள பெயர்',
    'lattitude'=>'அட்சரேகை',
    'longitude'=>'தீர்க்கரேகை',
    'track'=>'தட விவரங்கள்',
    'field'=>'கள விவரங்கள்',
    'edit_venue'=>'இடம் திருத்த',
    'track_details_desc'=>'ஹீட்ஸ் முறையில் இயங்கும் தடம் பிரிப்பான் சார்ந்து இருப்பதால், இடம் விவரங்களில் கட்டாயம் சேர்க்க வேண்டும்.',
    'field_details_desc'=>'இடம் விவரங்களில் கட்டாயம் சேர்க்க வேண்டும், ஏனெனில் அந்த நிகழ்வு நிறுவனத்தை எங்கு நடத்துவது என்பது முன்கூட்டியே திட்டமிடப்பட்டுள்ளது.',




]
?>