app/Http/Controllers/DashboardController.php

	public function dashboard(Request $request)
	{
		$org=Auth::user()->organization_id;
		$id =Session::get('id');
		$user_count = User::count();
		$orgs=User::where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->where('is_approved',1)->get();
		$futureLeagues=League::where('to_date','>',Carbon::now())->where('from_date','>',Carbon::now())->where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->get();
		$pastLeagues=League::where('to_date','<',Carbon::now())->where('from_date','<',Carbon::now())->where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->get();
		$ongngLeaguesCount=League::where('to_date','>',Carbon::now())->where('from_date','<',Carbon::now())->where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->get();
		if(count($ongngLeaguesCount)>0){
			$ongngLeagues=League::where('to_date','>',Carbon::now())->where('from_date','<',Carbon::now())->where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->first();
		}else{
			$ongngLeagues=League::where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->orderBy('id','desc')->latest()->first();
		}
		$ongngLeagues1=League::where('to_date','>',Carbon::now())->where('from_date','<',Carbon::now())->where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->first();
		$genders=AgeGroupGender::with('ageGroupEvent')->get();
		// dd($ongngLeagues->athelaticsetting->third_place);

		$logs = DB::table('active_users')->latest()->take(5)->get();
		$users = User::orderBy('id', 'desc')->take(6)->get();
		$roles = Role::all();
		$chart_data = User::select(DB::raw("COUNT(*) as count_row"))
			->orderBy("created_at")
			->groupBy(DB::raw("month(created_at)"))
			->get();
		$organizations = Organization::all();
---
select count(*) as aggregate from `users`
select * from `users` where `organization_id` = 1 and `is_approved` = 1
select * from `leagues` where `to_date` > '2022-10-21 18:13:58' and `from_date` > '2022-10-21 18:13:58' and `organization_id` = 1
select * from `leagues` where `to_date` > '2022-10-21 18:13:58' and `from_date` < '2022-10-21 18:13:58' and `organization_id` = 1
select * from `leagues` where `organization_id` = 1 order by `id` desc, `created_at` desc limit 1
select * from `age_group_event` where `age_group_event`.`id` in (4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 84, 85) order by `age_group_id` asc
select * from `age_group_genders`
select * from `active_users` order by `created_at` desc limit 5
select * from `users` order by `id` desc limit 6
select * from `roles`
select COUNT(*) as count_row from `users` group by month(created_at) order by `created_at` asc
select * from `organizations`

		}
		else{
			$user=Auth::user()->organization_id?Auth::user()->organization_id:$id;
			$venues=Venue::where('organization_id',$user)->get();
			$org=Organization::find($user);
			$latestLeague=$org->leagues?League::where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->latest()->first():'';
			$registrations=Registration::where('league_id',$ongngLeagues?$ongngLeagues->id:'')->select(DB::raw("COUNT(*) as count_row"), 'league_id')
			->orderBy("created_at")
			->groupBy(DB::raw("league_id"))
			->where('is_approved',1)
			->get();
			// dd($ongngLeagues);
			$grpregistrations=GroupRegistration::where('league_id',$ongngLeagues?$ongngLeagues->id:'')->select(DB::raw("COUNT(*) as count_row"), 'league_id')
			->orderBy("created_at")
			->groupBy(DB::raw("league_id"))
			->get();
			$leagues=League::where('organization_id',Auth::user()->organization_id?Auth::user()->organization_id:$id)->get();



			$clubParticipantCounts = DB::table('users')
			->leftJoin('registrations', 'registrations.user_id', '=', 'users.id')
			->select(DB::raw("COUNT(*) as count_row", 'registrations.user_id'),'users.club_id')
			->where('registrations.league_id',$ongngLeagues?$ongngLeagues->id:'')
			->where('users.club_id','!=','null')
			->groupBy(DB::raw("users.club_id"))
			->get();

			$clubGroupParticipantCounts = DB::table('group_registrations')
			->select(DB::raw("COUNT(*) as count_row", 'group_registrations.club_id'),'group_registrations.club_id')
			->where('group_registrations.league_id',$ongngLeagues?$ongngLeagues->id:'')
			->groupBy(DB::raw("group_registrations.club_id"))
			->get();
---
select * from `venues` where `organization_id` = 1
select * from `organizations` where `organizations`.`id` = 1 limit 1
select * from `leagues` where `leagues`.`organization_id` = 1 and `leagues`.`organization_id` is not null
select COUNT(*) as count_row, `league_id` from `registrations` where `league_id` = 1 and `is_approved` = 1 group by league_id order by `created_at` asc
select COUNT(*) as count_row, `league_id` from `group_registrations` where `league_id` = 1 group by league_id order by `created_at` asc
select * from `leagues` where `organization_id` = 1
select COUNT(*) as count_row, `users`.`club_id` from `users` left join `registrations` on `registrations`.`user_id` = `users`.`id` where `registrations`.`league_id` = 1 and `users`.`club_id` != 'null' group by users.club_id
select COUNT(*) as count_row, `group_registrations`.`club_id` from `group_registrations` where `group_registrations`.`league_id` = 1 group by group_registrations.club_id

			->where('league_id',$ongngLeagues?$ongngLeagues->id:'')
			->groupBy(DB::raw("league_id"))
			->get();
			$groupEventCounts = Registration::select(DB::raw("COUNT(*) as count_row"),  'league_id')
			->where('organization_id',  $user)
			->where('status',4)
			->where('league_id',$ongngLeagues?$ongngLeagues->id:'')
			->groupBy(DB::raw("league_id"))
			->get();
			$singleEventGroupCounts = GroupRegistration::select(DB::raw("COUNT(*) as count_row"),  'league_id')
			->where('organization_id',  $user)
			->where('status',[1,2])
			->where('league_id',$ongngLeagues?$ongngLeagues->id:'')
			->groupBy(DB::raw("league_id"))
			->get();
			$groupEventGroupCounts = GroupRegistration::select(DB::raw("COUNT(*) as count_row"),  'league_id')
			->where('organization_id',  $user)
			->where('status',0)
			->where('league_id',$ongngLeagues?$ongngLeagues->id:'')
			->groupBy(DB::raw("league_id"))
			->get();
		foreach ($singleEventCounts as $singleEventCount) {
			$league=DB::table('leagues')->where('id',$singleEventCount->league_id)->first();
---
select COUNT(*) as count_row, `league_id` from `registrations` where `organization_id` = 1 and `status` = 2 and `league_id` = 1 group by league_id
select COUNT(*) as count_row, `league_id` from `registrations` where `organization_id` = 1 and `status` = 4 and `league_id` = 1 group by league_id
select COUNT(*) as count_row, `league_id` from `group_registrations` where `organization_id` = 1 and `status` = 1 and `league_id` = 1 group by league_id
select * from `leagues` where `id` = 1 limit 1

		$firstPlaceCount=[];
		$secondPlaceCount=[];
		$thirdPlaceCount=[];
		 $clubs=Club::where('is_approved',1)->wherehas('users',function($q){
			$q->has('registrations','>',0);
		 })->get();
---
select * from `clubs` where `is_approved` = 1 and exists (select * from `users` where `clubs`.`id` = `users`.`club_id` and (select count(*) from `registrations` where `users`.`id` = `registrations`.`user_id`) > 0)

		$firstPlaceCount[] = array(
			$firstPlace
	);
	$secondPlace= DB::table('users')
	->leftJoin('age_group_gender_user', 'age_group_gender_user.user_id', '=', 'users.id')
	->select(DB::raw("COUNT(*) as count_row", 'age_group_gender_user.user_id'),'users.club_id','age_group_gender_user.marks')
	->where('users.club_id',$club->id)
	->where('age_group_gender_user.league_id',$ongngLeagues?$ongngLeagues->id:'')
	->where('age_group_gender_user.marks','=',$ongngLeagues?$ongngLeagues->organization->athelaticsetting->second_place:'')
	->groupBy(DB::raw("users.club_id"))
	->count();
---
select count(*) as aggregate from `users` left join `age_group_gender_user` on `age_group_gender_user`.`user_id` = `users`.`id` where `users`.`club_id` = 2 and `age_group_gender_user`.`league_id` = 1 and `age_group_gender_user`.`marks` = '5'

		);


	$thirdPlace= DB::table('users')
	->leftJoin('age_group_gender_user', 'age_group_gender_user.user_id', '=', 'users.id')
	->select(DB::raw("COUNT(*) as count_row", 'age_group_gender_user.user_id'),'users.club_id','age_group_gender_user.marks')
	->where('users.club_id',$club->id)
	->where('age_group_gender_user.league_id',$ongngLeagues?$ongngLeagues->id:'')
	->where('age_group_gender_user.marks','=',$ongngLeagues?$ongngLeagues->organization->athelaticsetting->third_place:'')
	->count();
---
select count(*) as aggregate from `users` left join `age_group_gender_user` on `age_group_gender_user`.`user_id` = `users`.`id` where `users`.`club_id` = 2 and `age_group_gender_user`.`league_id` = 1 and `age_group_gender_user`.`marks` = '1'