app/Http/Controllers/JoshController.php

select count(*) as aggregate from `users`
select * from `users` order by `id` desc limit 6
select * from `roles`
select COUNT(*) as count_row from `users` group by month(created_at) order by `created_at` asc
select COUNT(*) as count_row from `users` left join `model_has_roles` on `model_has_roles`.`model_id` = `users`.`id` group by model_has_roles.role_id
---


		//total users
		$user_count = User::count();
		//total Blogs
		// $blog_count = Blog::count();
		// $blogs = Blog::orderBy('id', 'desc')->take(5)->get()->load('category', 'author');
		$users = User::orderBy('id', 'desc')->take(6)->get();
		$roles = Role::all();
		$chart_data = User::select(DB::raw("COUNT(*) as count_row"))
			->orderBy("created_at")
			->groupBy(DB::raw("month(created_at)"))
			->get();
		$userCounts = DB::table('users')
			->leftJoin('model_has_roles', 'model_has_roles.model_id', '=', 'users.id')
			->select(DB::raw("COUNT(*) as count_row", 'model_has_roles.role_id'))
			->groupBy(DB::raw("model_has_roles.role_id"))
			->get();

select COUNT(*) as count_row, `roles`.`name` from `model_has_roles` inner join `users` on `users`.`id` = `model_has_roles`.`model_id` left join `roles` on `model_has_roles`.`role_id` = `roles`.`id` group by model_has_roles.role_id
---

		//     ->groupBy('name');

		$roles = DB::table('model_has_roles')
			->join('users', 'users.id', '=', 'model_has_roles.model_id')
			->leftJoin('roles', 'model_has_roles.role_id', '=', 'roles.id')
			->select(DB::raw("COUNT(*) as count_row"), 'roles.name')
			->groupBy(DB::raw("model_has_roles.role_id"))
			->get();

select COUNT(*) as count_row, `organization_id` from `users` where `organization_id` != 'null' group by organization_id order by `created_at` asc
select COUNT(*) as count_row, `club_id` from `users` where `club_id` != 'null' group by club_id order by `created_at` asc
select COUNT(*) as count_row, `country_id` from `organizations` group by country_id order by `created_at` asc
---
		//     ->dimensions(0, 150)
		//     ->responsive(true)
		//     ->groupByMonth( 2017, true);
		$userCounts = User::select(DB::raw("COUNT(*) as count_row"), 'organization_id')
			->orderBy("created_at")
			->where('organization_id', '!=', 'null')
			->groupBy(DB::raw("organization_id"))
			->get();
		$clubUserCounts = User::select(DB::raw("COUNT(*) as count_row"), 'club_id')
			->orderBy("created_at")
			->where('club_id', '!=', 'null')
			->groupBy(DB::raw("club_id"))
			->get();
			$countryOrgCounts= Organization::select(DB::raw("COUNT(*) as count_row"), 'country_id')
			->orderBy("created_at")
			->groupBy(DB::raw("country_id"))
			->get();

select * from `organizations`
---

				 }
				 else{
					$orgs=Organization::all();

select COUNT(*) as count_row, `gender`, `club_id` from `users` where `club_id` != 'null' and `gender` = 'male' group by club_id order by `created_at` asc
---
			->get();
		}
		else{
			$clubMales = User::select(DB::raw("COUNT(*) as count_row"), 'gender', 'club_id')
			->orderBy("created_at")
			->where('club_id', '!=', 'null')
			->where('gender', 'male')
			->groupBy(DB::raw("club_id"))
			->get();

select COUNT(*) as count_row, `gender`, `club_id` from `users` where `club_id` != 'null' and `gender` = 'female' group by club_id order by `created_at` asc
---
			->get();
		}
		else{
			$clubFemales = User::select(DB::raw("COUNT(*) as count_row"), 'gender', 'club_id')
			->orderBy("created_at")
			->where('club_id', '!=', 'null')
			->where('gender', 'female')
			->groupBy(DB::raw("club_id"))
			->get();

select * from `clubs`
---

		}
		else{
	$clubs=Club::all();

select count(*) as aggregate from `users` where `users`.`club_id` = 1 and `users`.`club_id` is not null and `gender` = 'male'
---


			);
			$male=$club->users()->where('gender','male')->count();

select count(*) as aggregate from `users` where `users`.`club_id` = 1 and `users`.`club_id` is not null and `gender` = 'female'
---


		);
		$female=$club->users()->where('gender','female')->count();

select * from `leagues` where `to_date` > '2022-10-25 05:32:31'
---



		$leagues = League::where('to_date','>',Carbon::now())->get();

select * from `organizations`
---
			$organizations=Organization::where('country_id',Auth::user()->country_id)->get();
		}
		else{
			$organizations=Organization::get();

select * from `clubs`
---
			$clubs=Club::where('country_id',Auth::user()->country_id)->get();
		}
		else{
			$clubs = Club::all();

select * from `users`
select * from `countries`
select * from `active_users` order by `created_at` desc limit 5
select * from `leagues` where `to_date` > '2022-10-25 05:32:31' and `from_date` > '2022-10-25 05:32:31' limit 8 offset 0
select count(*) as aggregate from `leagues` where `to_date` > '2022-10-25 05:32:31' and `from_date` > '2022-10-25 05:32:31'
select * from `day_users` where `date` = '2022-10-25'
---
			$users=User::where('country_id',Auth::user()->country_id)->get();
		}
		else{
			$users = User::all();

		}
		$countries=Country::all();
		$logs = DB::table('active_users')->latest()->take(5)->get();
		$futureLeagues=League::where('to_date','>',Carbon::now())->where('from_date','>',Carbon::now())->paginate(8);
		$todayActiveUsers=null;
		 $todayActiveUsers=DB::table('day_users')->where('date',Carbon::now()->toDateString())->get();

select * from `clubs` where `is_approved` = 2
select * from `active_users` order by `created_at` desc limit 5
---
			$clubRequests=Club::where('country_id',Auth::user()->country_id)->where('is_approved',2)->get();
		}
		else{
			$clubRequests=Club::where('is_approved',2)->get();

		}
		$logs = DB::table('active_users')->latest()->take(5)->get();