app/Http/Controllers/Admin/EventController.php

select * from `leagues` where `organization_id` = 1 and `season_id` in (1)
select * from `events` where `organization_id` = 1 and `season_id` in (1)
select * from `users` where `users`.`id` in (6)
select `age_groups`.*, `age_group_event`.`event_id` as `pivot_event_id`, `age_group_event`.`age_group_id` as `pivot_age_group_id`, `age_group_event`.`id` as `pivot_id` from `age_groups` inner join `age_group_event` on `age_groups`.`id` = `age_group_event`.`age_group_id` where `age_group_event`.`event_id` in (3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16)
select * from `org_settings` where `organization_id` = 1 limit 1
---
    public function allEvents(Request $request)
    {
        Session::forget('ordertype');
        Session::forget('columnname');
        Session::forget('search');
        $id = Session::get('id');
        $seasonIds = array();
        $seasons = Season::where('status', 1)->get();
        foreach ($seasons as $season) {
            $seasonIds[] = $season->id;
        }
        $leagues = League::where('organization_id', Auth::user()->organization_id ? Auth::user()->organization_id : $id)->whereIn('season_id', $seasonIds)->get();
        $events = Event::with(['user', 'ageGroups'])->where('organization_id', Auth::user()->organization_id ? Auth::user()->organization_id : $id)->whereIn('season_id',$seasonIds)->get();
        $setting = OrganizationSetting::where('organization_id', Auth::user()->organization_id !== null ? Auth::user()->organization_id : $id)->first();

select * from `organizations`
---
            $upcomingEvents = Auth::user()->registrations;
                        $upcomingEventsOld = Auth::user()->registrations;
            $seasons = Season::where('status', 1)->get();
            $organizations = Organization::all();

select * from `age_group_genders` where `status` not in (1)
---
}
else{

    $genders = AgeGroupGender::whereNotIn('status',[1])->get();

select * from `events` where `organization_id` = 1 order by `created_at` asc
select * from `age_groups` where `organization_id` = 1
select * from `genders`
select * from `main_events` where `organization_id` = 1
select * from `leagues` where `organization_id` = 1 and `season_id` in (1) and `to_date` >= '2022-10-25'
select * from `teams` where `club_id` is null
select * from `org_settings` where `organization_id` = 1 limit 1
---
Session::put('gendersSortBy', $genders);
            $judges = User::role('Judge')->where('organization_id', Auth::user()->organization_id ? Auth::user()->organization_id : $id)->where('is_approved', 1)->get();
            $starters = User::role('Starter')->where('organization_id', Auth::user()->organization_id ? Auth::user()->organization_id : $id)->where('is_approved', 1)->get();
            $events = Event::where('organization_id', Auth::user()->organization_id ? Auth::user()->organization_id : $id)->orderBy('created_at', 'ASC')->get();
            $agegroups = AgeGroup::where('organization_id', Auth::user()->organization_id ? Auth::user()->organization_id : $id)->get();
            $seasons = Season::where('status',1)->get();
            $gender = Gender::all();
            $ageGroups = AgeGroup::where('organization_id', Auth::user()->organization_id !== null ? Auth::user()->organization_id : $id)->get();
            $mainEvents = MainEvent::where('organization_id', Auth::user()->organization_id !== null ? Auth::user()->organization_id : $id)->get();
            $leagues = League::where('organization_id', Auth::user()->organization_id ? Auth::user()->organization_id : $id)->whereIn('season_id', $seasonIds)->where('to_date', '>=', Carbon::now()->format('Y-m-d'))->get();
            $teams = Team::where('club_id', Auth::user()->club_id)->get();
            $setting = OrganizationSetting::where('organization_id', Auth::user()->organization_id !== null ? Auth::user()->organization_id : $id)->first();