app/Http/Controllers/Admin/RolesController.php

    public function permission($id)
    {

        $organizations = Organization::all();
        $general = generalSetting::first();

        $permissionGroups = Permission::select('group_name')->groupBy('group_name')->get();
        $role = Role::find($id);
---
select * from `organizations`
select `group_name` from `permissions` group by `group_name`
select * from `roles` where `roles`.`id` = '2' limit 1