app/Http/Controllers/Admin/UsersController.php

                ->orWhereYear('dob',$dob!=null?$dob:'');
            }) ->paginate(10);

                            $users2 = User::whereNotIn('id', [1])->where('organization_id', null)->where('club_id',null)
                            ->where(function($query) use($search,$dob){
                                return $query
                                ->whereHas('roles', function ($q) use ($search) {
                                $q->where('name', 'like', '%' . $search . '%');


                            })

                            ->orwhereHas('country', function ($q) use ($search) {
                                $q->where('name', 'like', '%' . $search . '%');
                            })

                            ->orWhere('first_name','like', '%' . $search . '%')
                            ->orWhere('last_name','like', '%' . $search . '%')
                            ->orWhere('email', $search )
                            ->orWhere('tel_number',$search)
                            ->orWhereYear('dob',$dob!=null?$dob:'');
                        })->get();
---
select count(*) as aggregate from `users` where `id` not in (1) and `club_id` is null and `organization_id` is null
select * from `users` where `id` not in (1) and `club_id` is null and `organization_id` is null order by `id` desc, `id` desc
select * from `roles` where `id` not in (8)

    public function update(Request $request, $id)
    {
        // dd($request->all());




            $user = User::find($id);

        $user->first_name = $request->input('first_name');
         $user->last_name = $request->input('last_name');
        $user->organization_id = Auth::user()->organization_id;
        $user->guardian_name = $request->input('gu_name');
        $user->guardian_mail = $request->input('gu_email');
        $user->guardian_number = $request->input('gu_number');
        $user->gender = $request->input('gender');
        $user->country_id = $request->input('country');
---
select * from `users` where `users`.`id` = 2 limit 1
select * from `countries`

            elseif ($key == "club") {
                if($values!=0){
                    if ($values=="exceptClub"){
                        $users = User::where([['organization_id','=',Auth::user()->organization_id !== null ? Auth::user()->organization_id : $id],['is_approved','=',1]])->where('club_id',null);
---
select * from `users` where `users`.`id` = 1 limit 1